package com.vitoboy.leetcode.tags.math;

/**
 * 
 * 给定一个长度为 n 的 非空 整数数组，每次操作将会使 n - 1 个元素增加 1。找出让数组所有元素相等的最小操作次数。 
 *
 *  示例：
 * 输入： [1,2,3]
 * 输出： 3
 * 解释：
 * 只需要3次操作（注意每次操作会增加两个元素的值）：
 * [1,2,3]  =>  [2,3,3]  =>  [3,4,3]  =>  [4,4,4]
 *  
 *  Related Topics 数组 数学 
 *  👍 234 👎 0
 * 
 * 
 * @author vito
 * @version 1.0
 * @date 2021/7/5
 */
public class I453I_MinMoves {
    public static void main(String[] args) {

    }

    /**
     * [1,2,3,4]->[2,3,4,4]->[3,4,5,4]->[4,5,5,5]->[5,6,6,5]->[6,7,6,6]->[7,7,7,7]
     *
     * [2,3,4,4]-> 5
     *
     * todo
     * @param nums
     * @return
     */
    public int minMoves(int[] nums) {

        return 0;
    }

}
