package com.vitoboy.leetcode.daily.aug;

import java.util.Arrays;

/**
 * @problem leetcode
 * @description 1337.矩阵中战斗力最弱的k行
 * 
 * 给你一个大小为 m * n 的矩阵 mat，矩阵由若干军人和平民组成，分别用 1 和 0 表示。 
 * 
 *  请你返回矩阵中战斗力最弱的 k 行的索引，按从最弱到最强排序。 
 * 
 *  如果第 i 行的军人数量少于第 j 行，或者两行军人数量相同但 i 小于 j，那么我们认为第 i 行的战斗力比第 j 行弱。 
 * 
 *  军人 总是 排在一行中的靠前位置，也就是说 1 总是出现在 0 之前。 
 *
 *  示例 1：
 * 输入：mat = 
 * [[1,1,0,0,0],
 *  [1,1,1,1,0],
 *  [1,0,0,0,0],
 *  [1,1,0,0,0],
 *  [1,1,1,1,1]], 
 * k = 3
 * 输出：[2,0,3]
 * 解释：
 * 每行中的军人数目：
 * 行 0 -> 2 
 * 行 1 -> 4 
 * 行 2 -> 1 
 * 行 3 -> 2 
 * 行 4 -> 5 
 * 从最弱到最强对这些行排序后得到 [2,0,3,1,4]
 *  
 * 
 *  示例 2：
 * 输入：mat = 
 * [[1,0,0,0],
 *  [1,1,1,1],
 *  [1,0,0,0],
 *  [1,0,0,0]], 
 * k = 2
 * 输出：[0,2]
 * 解释： 
 * 每行中的军人数目：
 * 行 0 -> 1 
 * 行 1 -> 4 
 * 行 2 -> 1 
 * 行 3 -> 1 
 * 从最弱到最强对这些行排序后得到 [0,2,3,1]
 *
 *  提示：
 *  m == mat.length 
 *  n == mat[i].length 
 *  2 <= n, m <= 100 
 *  1 <= k <= m 
 *  matrix[i][j] 不是 0 就是 1 
 *  
 *  Related Topics 数组 二分查找 矩阵 排序 堆（优先队列） 
 *  👍 100 👎 0
 * 
 * @author vito
 * @version 1.0
 * @date 2021/8/1
 */
public class I210801I_I1337I_KWeakestRows {
    public static void main(String[] args) {
        I210801I_I1337I_KWeakestRows rows = new I210801I_I1337I_KWeakestRows();
        int[][] mat = new int[][]{
                {1,1,0,0,0}, {1,1,1,1,0}, {1,0,0,0,0},{1,1,0,0,0},{1,1,1,1,1}
        };
        System.out.println(Arrays.toString(rows.kWeakestRows(mat, 3)));
        System.out.println("expect is : [2,0,3]");
    }

    /**
     * 				解答成功:
     * 				执行耗时:2 ms,击败了75.35% 的Java用户
     * 				内存消耗:39.5 MB,击败了50.23% 的Java用户
     *
     * 时间复杂度: O(N*M)
     * @param mat
     * @param k
     * @return
     */
    public int[] kWeakestRows(int[][] mat, int k) {
        int m = mat.length, n = mat[0].length;
        int[][] tmp = new int[m][2];
        for (int i = 0; i < m; i++) {
            int sum = 0;
            for (int j = 0; j < n; j++) {
                if (mat[i][j] > 0) {
                    sum += mat[i][j];
                } else {
                    break;
                }
            }
            tmp[i] = new int[]{i, sum};
        }
        Arrays.sort(tmp, ((o1, o2) -> {
            if(o1[1] == o2[1]) {
                return Integer.compare(o1[0], o2[0]);
            } else {
                return Integer.compare(o1[1],o2[1]);
            }
        }));
        int[] ans = new int[k];
        for (int i = 0; i <k; i++) {
            ans[i] = tmp[i][0];
        }
        return ans;
    }
}
